IDENTIFICATION DIVISION.
PROGRAM-ID. SHELLSORT.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 N PIC 999.
77 GAP PIC 999.
77 I PIC 999.
77 J PIC 999.
77 TEMP PIC 9(4).
77 ARR PIC 9(4) OCCURS 100 TIMES.

PROCEDURE DIVISION.
    DIVIDE N BY 2 GIVING GAP.
    PERFORM UNTIL GAP = 0.
        PERFORM VARYING I FROM GAP BY 1 UNTIL I > N.
            MOVE ARR(I) TO TEMP.
            MOVE I TO J.
            PERFORM UNTIL J < GAP OR ARR(J - GAP) NOT > TEMP.
                MOVE ARR(J - GAP) TO ARR(J).
                COMPUTE J = J - GAP.
            END-PERFORM.
            MOVE TEMP TO ARR(J).
        END-PERFORM.
        DIVIDE GAP BY 2 GIVING GAP.
    END-PERFORM.
    STOP RUN.
