//SHELLSRT JOB (ACCT),'SHELL SORT',CLASS=A,MSGCLASS=X
//SORT     EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD *
00000064
00000034
00000025
00000012
00000022
00000011
00000090
/*
//SORTOUT  DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=(1,8,CH,A)
/*
