//BSORT    JOB (ACCT),'BUBBLE SORT',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
PROC 'BUBBLE.SORT' EXEC(SORT)
SORT FIELDS=(1,3,BI,A)
RECORD LENGTH=3
END
/*
