//SELSORT  JOB  CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=SORT
//SORTIN   DD   *
00000005
00000003
00000001
00000004
00000002
//SORTOUT  DD   SYSOUT=*
//SYSIN    DD   *
  SORT FIELDS=(1,8,CH,A)
/*
