//ISORT    JOB  (ACCT),'INSERTION SORT',CLASS=A
//STEP1    EXEC PGM=SORT
//SYSIN    DD   *
  SORT FIELDS=(1,5,CH,A)
/*
//SORTIN   DD   DSN=INPUT.DATA,DISP=SHR
//SORTOUT  DD   DSN=OUTPUT.DATA,DISP=(NEW,CATLG)
//
