//RADIXSRT JOB (ACCT),'RADIX SORT',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=SORT
//SYSOUT   DD   SYSOUT=*
//SORTIN   DD   *
000001700
000000450
000000750
000000900
000008020
000000240
000000020
000000660
/*
//SORTOUT  DD   SYSOUT=*
//SYSIN    DD   *
  SORT FIELDS=(1,3,BI,A,4,6,BI,A),FORMAT=BI
  OUTREC FIELDS=(1,9)
/*
