//COCKTAIL JOB (ACCT),'COCKTAIL SORT',CLASS=A,MSGCLASS=A
//SORT    EXEC PGM=SORT
//SYSOUT  DD SYSOUT=*
//SORTIN  DD *
00000005
00000003
00000008
00000001
00000009
00000002
00000007
00000004
00000006
00000000
//SORTOUT DD SYSOUT=*
//SYSIN   DD *
  SORT FIELDS=(1,8,CH,A)
/*
