//MERGSORT JOB (ACCOUNT),'MERGE SORT',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD *
00003800
00002700
00004300
00000300
00000900
00008200
00001000
//SORTOUT  DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=(1,8,CH,A)
  MERGE FIELDS=(1,8,CH,A)
/*
